Rasshireniya/ТаймТрекер/Catalogs/тт_ЭлементыРасписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>тт_ЭлементыРасписания</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПлановое</Name>
					<Comment>Время по плану в часах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяФактическое</Name>
					<Comment>Время суммарное в часах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяАстрономическое</Name>
					<Comment>Астрономическое время в часах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спринт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узСпринты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Факт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Comment>Время отрезка в секундах</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Rasshireniya/ТаймТрекер/Catalogs/тт_ЭлементыРасписания/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = Пользователи.АвторизованныйПользователь();
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.узЗадачи") Тогда
		Задача = ДанныеЗаполнения;
		СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения,"Наименование, ТекстСодержания, Исполнитель");
		Наименование = СтруктураРеквизитов.Наименование;
		Примечание = Лев(СтрЗаменить(СтруктураРеквизитов.ТекстСодержания,Символы.ПС," "),500);
		Исполнитель = СтруктураРеквизитов.Исполнитель;
	КонецЕсли;
КонецПроцедуры


Процедура ПередЗаписью(Отказ)
	ВремяПлановое = (ДатаОкончанияПлан - ДатаНачалаПлан)/3600;
	Минимум = Дата(1,1,1);
	Максимум = Дата(1,1,1);
	Для Каждого СтрокаТЧ Из Факт Цикл
		Если Минимум = Дата(1,1,1) Тогда
			Минимум = СтрокаТЧ.ДатаНачалаФакт;
		Иначе
			Минимум = Мин(Минимум,СтрокаТЧ.ДатаНачалаФакт);
		КонецЕсли;
		Если СтрокаТЧ.ДатаОкончанияФакт <> Дата(1,1,1) Тогда
			Максимум = Макс(Максимум, СтрокаТЧ.ДатаОкончанияФакт);
			СтрокаТЧ.Факт = СтрокаТЧ.ДатаОкончанияФакт - СтрокаТЧ.ДатаНачалаФакт;
		КонецЕсли;
	КонецЦикла;
	ВремяФактическое = Факт.Итог("Факт")/3600;
	Если Максимум <> Дата(1,1,1) Тогда
		ВремяАстрономическое = (Максимум - Минимум)/3600;
	Иначе
		ВремяАстрономическое = 0;
	КонецЕсли;
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	СообшениеОбОшибке = "";
	Для Каждого СтрокаТЧ Из Факт Цикл
		Если СтрокаТЧ.ДатаОкончанияФакт <> Дата(1,1,1) И СтрокаТЧ.ДатаОкончанияФакт < СтрокаТЧ.ДатаНачалаФакт Тогда
			Отказ = Истина;
			СообшениеОбОшибке = СообшениеОбОшибке + Символы.ПС + "Не корректно заполнено время в строке " + СтрокаТЧ.НомерСтроки;
		КонецЕсли;
	КонецЦикла;
	Если Отказ Тогда
		ВызватьИсключение СообшениеОбОшибке;
	КонецЕсли;
КонецПроцедуры
